In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(
        {"a" : [4 ,5, 6, 6, np.nan], 
        "b" : [7, 8, np.nan, 9, 9], 
        "c" : [10, 11, 12, np.nan, 12]},    
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2),('e',3),('e',4)], 
        names=['n','v']))
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [9]:
df.loc['d', 1] # 행을 보려면 loc를 쓰자 > 기본적으로 columns를 먼저 색인함

a     4.0
b     7.0
c    10.0
Name: (d, 1), dtype: float64

In [11]:
df[['b', 'c']] # 여러 행을 보고 싶다면 리스트의 형태로 사용

       b     c
n v
d 1  7.0  10.0
  2  8.0  11.0
e 2  NaN  12.0
  3  9.0   NaN
  4  9.0  12.0

In [12]:
df['c']

n  v
d  1    10.0
   2    11.0
e  2    12.0
   3     NaN
   4    12.0
Name: c, dtype: float64

In [13]:
df.c

n  v
d  1    10.0
   2    11.0
e  2    12.0
   3     NaN
   4    12.0
Name: c, dtype: float64

In [14]:
df.loc[('d', 2), 'b'] # 특정 columns와 특정 row를 동시에 색인하고 싶은 경우

8.0

In [15]:
df.loc[:, 'b':'c']

       b     c
n v
d 1  7.0  10.0
  2  8.0  11.0
e 2  NaN  12.0
  3  9.0   NaN
  4  9.0  12.0

In [17]:
df = pd.DataFrame(np.array(([1, 2, 3], [4, 5, 6])),
                  index=['mouse', 'rabbit'],
                  columns=['one','two','three']
                 )
df

        one  two  three
mouse     1    2      3
rabbit    4    5      6

In [19]:
df.filter(items=['one', 'three'])

        one  three
mouse     1      3
rabbit    4      6

In [20]:
df.filter(regex='e$', axis=1) # e로 끝나는 컬럼명만 선택

        one  three
mouse     1      3
rabbit    4      6

In [21]:
df.filter(like='bbi', axis=0) # bbi를 포함하는 행 선택 > axis = 0 : row, axis = 1 : column

        one  two  three
rabbit    4    5      6

In [22]:
df.loc[df['two'] > 3, ['one', 'three']] # two 컬럼이 3보다 큰 행의 one, three 컬럼 출력하기

        one  three
rabbit    4      6

In [25]:
df.iloc[0, 1] # 좌표 찍을 때 사용 (Integer 형)

2

In [27]:
df.iloc[:, [0, 2]]

        one  three
mouse     1      3
rabbit    4      6